Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: By using :cpp:expr:`lv_obj_bind_style`, it's possible to add a style to a Widget but enable it only if a :ref:`Subject <observer_overview>`'s value is equal to a reference value.
it_it: Utilizzando :cpp:expr:`lv_obj_bind_style`, è possibile aggiungere uno stile a un Widget, ma abilitarlo solo se il valore di :ref:`Subject <observer_overview>` è uguale a un valore di riferimento.

source: By using :cpp:expr:`lv_screen_load_anim(scr, transition_type, time, delay, auto_del)` screen loading can be performed
it_it: Usando :cpp:expr:`lv_screen_load_anim(scr, transition_type, time, delay, auto_del)`, il caricamento dello Screen può essere eseguito

source: By using :cpp:func:`lv_display_flush_ready` LVGL will normally spin in a loop while waiting for flushing.
it_it: Utilizzando :cpp:func:`lv_display_flush_ready`, LVGL normalmente esegue un ciclo in attesa del flush.

source: By using :ref:`Groups <indev_groups>`, even complex UIs can be navigated by a single encoder.
it_it: Utilizzando i :ref:`Gruppi <indev_groups>`, anche le interfacce utente complesse si possono navigare con un singolo encoder.

source: By using Online Share, GitHub repositories can be viewed and even edited in the browser without setting up any developer environments.
it_it: Utilizzando Online Share, i repository GitHub possono essere visualizzati e persino modificati nel browser senza dover configurare alcun ambiente di sviluppo.

source: By using `Env tool <https://www.rt-thread.io/download.html?download=Env>`__ or `RT-Thread Studio IDE <https://www.rt-thread.io/download.html?download=Studio>`__, RT-Thread users can easily download LVGL source code and combine with RT-Thread project.
it_it: Utilizzando `Env tool <https://www.rt-thread.io/download.html?download=Env>`__ o `RT-Thread Studio IDE <https://www.rt-thread.io/download.html?download=Studio>`__, gli utenti di RT-Thread possono scaricare facilmente il codice sorgente di LVGL e integrarlo nel progetto RT-Thread.

source: By using docker containers it allows developers to focus on the application instead of building and maintaining a custom distribution.
it_it: Utilizzando i container Docker, consente agli sviluppatori di concentrarsi sull'applicazione anziché creare e gestire una distribuzione personalizzata.

source: By using https://viewer.lvgl.io/ you can easily try them out right in your browser.
it_it: Con https://viewer.lvgl.io/ si possono provare facilmente direttamente nel browser.

source: By using lines like ``if(lv_streq("text", name)) lv_label_set_text(obj, value);``, any ``set`` function can be mapped to XML properties.
it_it: Utilizzando righe come ``if(lv_streq("text", name)) lv_label_set_text(obj, value);``, qualsiasi funzione ``set`` può essere mappata alle proprietà XML.

source: By using parts you can apply different :ref:`styles <basics_styles>` to the parts of a widget.
it_it: Utilizzando le *parti* è possibile applicare diversi :ref:`stili <basics_styles>` alle parti di un widget.

source: By using the Canvas Widget with an :cpp:enumerator:`LV_COLOR_FORMAT_L8` buffer, bitmap masks can be rendered dynamically.
it_it: Utilizzando il Widget Canvas con un buffer :cpp:enumerator:`LV_COLOR_FORMAT_L8`, è possibile eseguire il rendering dinamico delle maschere bitmap.

source: By using the ``--device`` argument it is possible to map a device to a container.
it_it: Utilizzando l'argomento ``--device`` è possibile mappare un dispositivo a un container.

source: By using the ``<screen_load_event>`` and ``<screen_create_event>`` tags as children of a widget or component, screens can be loaded or created on a trigger (e.g., click).
it_it: Utilizzando i tag ``<screen_load_event>`` e ``<screen_create_event>`` come elementi figli di un widget o di un componente, le schermate possono essere caricate o create in base a un trigger (ad esempio, un clic).

source: By using this color format, no manual byte swapping is needed at all, simplifying display drivers and eliminating software overhead.
it_it: Utilizzando questo formato colore, non è necessario alcuno scambio manuale di byte, semplificando i driver video ed eliminando il sovraccarico software.

source: By using this function, any number of screen instances can be created and loaded as needed.
it_it: Utilizzando questa funzione, è possibile creare e caricare un numero qualsiasi di istanze di schermata, a seconda delle necessità.

source: C compiler (gcc, msvc, clang, etc...)
it_it: Compilatore C (gcc, msvc, clang, ecc...)

source: C strings starting with Unicode characters (e.g. icons) in UTF-8
it_it: Stringhe C che iniziano con caratteri Unicode (ad esempio icone) in UTF-8

source: C99 or newer compiler
it_it: Compilatore C99 o successivo

source: CLEARED otherwise.
it_it: CLEARED in caso contrario.

source: CLEARED when the Subject's value is 0, and
it_it: CLEARED quando il valore del Subject è 0 e

source: CMake Integration
it_it: Integrazione con CMake

source: CMake configuration:
it_it: Configurazione di CMake:

source: CMake is a cross-platform build system generator.
it_it: CMake è un generatore di sistemi di build multipiattaforma.

source: CMake with GNU make or Ninja (for Linux builds).
it_it: CMake con GNU make o Ninja (per le build Linux).

source: CMakeLists for IDF
it_it: CMakeLists per IDF

source: CPU and Memory
it_it: CPU e Memoria

source: Cache Size
it_it: Dimensione della cache

source: Cache configuration:
it_it: Configurazione della cache:

source: Caching means some images will be left open, hence LVGL can quickly access them from ``dsc->decoded`` instead of needing to decode them again.
it_it: La memorizzazione nella cache implica che alcune immagini rimarranno aperte, quindi LVGL può accedervi rapidamente da ``dsc->decoded`` invece di doverle decodificare nuovamente.

source: Calendar
it_it: Calendario

source: Calendar is an editable Widget which allows selecting and clicking the dates with encoder or keyboard navigation as well as pointer-type input devices.
it_it: Il Calendar è un Widget modificabile che consente di selezionare e cliccare sulle date con la navigazione tramite encoder o tastiera, nonché con dispositivi di input di tipo puntatore.

source: Calendar stores these in a Drop-Down List Widget via :cpp:func:`lv_dropdown_set_options` so the passed string pointer can be supplied by a local variable or buffer and does not need to persist beyond the call.
it_it: Il calendario memorizza questi dati in un Widget "Drop-Down List" tramite :cpp:func:`lv_dropdown_set_options`, in modo che il puntatore stringa passato possa essere fornito da una variabile locale o da un buffer e non debba persistere oltre la chiamata.

source: Calendar with header
it_it: Calendario con intestazione

source: Call :cpp:expr:`lv_anim_timeline_delete(timeline)` function to delete the Animation Timeline.
it_it: Chiamare la funzione :cpp:expr:`lv_anim_timeline_delete(timeline)` per eliminare la Timeline dell'Animazione.

source: Call :cpp:expr:`lv_anim_timeline_get_playtime(timeline)` function to get the total duration (in milliseconds) of the entire Animation Timeline.
it_it: Chiamare la funzione :cpp:expr:`lv_anim_timeline_get_playtime(timeline)` per ottenere la durata totale (in millisecondi) dell'intera Timeline di Animazione.

source: Call :cpp:expr:`lv_anim_timeline_get_reverse(timeline)` function to get whether the Animation Timeline is also played in reverse after its forward play completes.
it_it: Chiamare la funzione :cpp:expr:`lv_anim_timeline_get_reverse(timeline)` per verificare se la Timeline dell'Animazione viene riprodotta anche al contrario dopo il completamento della riproduzione in avanti.

source: Call :cpp:expr:`lv_anim_timeline_pause(timeline)` to pause the Animation Timeline.
it_it: Si chiama :cpp:expr:`lv_anim_timeline_pause(timeline)` per mettere in pausa la Timeline dell'Animazione.

source: Call :cpp:expr:`lv_anim_timeline_set_progress(timeline, progress)` function to set the state of the Animation Timeline according to the ``progress`` value.
it_it: Chiamare la funzione :cpp:expr:`lv_anim_timeline_set_progress(timeline, progress)` per impostare lo stato della Timeline di Animazione in base al valore ``progress``.

source: Call :cpp:expr:`lv_anim_timeline_start(timeline)` to start the Animation Timeline.
it_it: Chiamare :cpp:expr:`lv_anim_timeline_start(timeline)` per avviare la Timeline dell'Animazione.

source: Call :cpp:expr:`lv_chart_refresh(chart)` when a chart's data has changed to signal that the chart should be re-rendered next time a display refresh occurs.
it_it: Chiamare :cpp:expr:`lv_chart_refresh(chart)` quando i dati di un grafico sono cambiati per segnalare che il grafico deve essere nuovamente visualizzato al successivo aggiornamento del display.

source: Call :cpp:expr:`lv_draw_mask_rect(layer, &dsc)`.
it_it: Chiamare :cpp:expr:`lv_draw_mask_rect(layer, &dsc)`.

source: Call :cpp:expr:`lv_obj_add_state(widget, LV_STATE_CHECKED)` to turn it on, or :cpp:expr:`lv_obj_remove_state(widget, LV_STATE_CHECKED)` to turn it off programmatically.
it_it: Chiamare :cpp:expr:`lv_obj_add_state(widget, LV_STATE_CHECKED)` per attivarlo, oppure :cpp:expr:`lv_obj_remove_state(widget, LV_STATE_CHECKED)` per disattivarlo da programma.

source: Call :cpp:expr:`lv_tick_inc(x)` periodically, where ``x`` is the elapsed milliseconds since the last call.
it_it: Chiamare periodicamente :cpp:expr:`lv_tick_inc(x)`, dove ``x`` rappresenta i millisecondi trascorsi dall'ultima chiamata.

source: Call :cpp:func:`lv_barcode_set_direction` to set the bar code's orientation.
it_it: Si chiama :cpp:func:`lv_barcode_set_direction` per impostare l'orientamento del codice a barre.

source: Call :cpp:func:`lv_barcode_set_scale` to adjust scaling, call :cpp:func:`lv_barcode_set_dark_color` and :cpp:func:`lv_barcode_set_light_color` adjust colors.
it_it: Chiamare :cpp:func:`lv_barcode_set_scale` per regolare la scala, chiamare :cpp:func:`lv_barcode_set_dark_color` e :cpp:func:`lv_barcode_set_light_color` per regolare i colori.

source: Call Function
it_it: Chiamata di Funzione

source: Call LVGL functions to create screens, widgets, styles, animations, events, etc.
it_it: Chiamare le funzioni LVGL per creare schermate, widget, stili, animazioni, eventi, ecc.

source: Call lv_init()
it_it: Chiamare lv_init()

source: Call lv_timer_handler() in a loop
it_it: Chiamare lv_timer_handler() in un ciclo

source: Call returns immediately if `disp->flushing == 0`.
it_it: La chiamata termina immediatamente se `disp->flushing == 0`.

source: Callbacks
it_it: Callback

source: Callbacks that are declared according to this convention allow the binding to register a MicroPython object next to the function pointer when registering a callback, and access that object when the callback is called.
it_it: Le callback dichiarate secondo questa convenzione consentono al binding di registrare un oggetto MicroPython accanto al puntatore a funzione quando si registra una callback e di accedere a tale oggetto quando la callback viene chiamata.

source: Calling :cpp:expr:`lv_display_get_screen_loading(disp)` will return the screen that is being loaded.
it_it: Chiamando :cpp:expr:`lv_display_get_screen_loading(disp)` verrà restituito lo screen in fase di caricamento.

source: Calling :cpp:func:`lv_gltf_model_node_get_world_position` without world position registration will return ``LV_RESULT_INVALID``
it_it: Chiamare :cpp:func:`lv_gltf_model_node_get_world_position` senza registrare la posizione del "world" restituirà ``LV_RESULT_INVALID``

source: Calling it for Display or Indev targets is considered Undefined Behavior.
it_it: Chiamarlo per target Display o Indev è considerato un Comportamento Indefinito.

source: Calling this function adds a footer (container) if one was not already present, and it returns a pointer to the button created, which can be used to add ``LV_EVENT_CLICKED`` (or other) events to detect and act on the user's response.
it_it: La chiamata a questa funzione aggiunge un piè di pagina (contenitore) se non ne è già presente uno e restituisce un puntatore al pulsante creato, che può essere utilizzato per aggiungere eventi ``LV_EVENT_CLICKED`` (o altri) per rilevare e agire sulla risposta dell'utente.

source: Camera & Viewport
it_it: Telecamera & Viewport

source: Camera Controls
it_it: Controlli Telecamera

source: Camera switching
it_it: Cambio telecamera

source: Can be LINE (default), BAR, STACKED, SCATTER, or NONE.
it_it: Può essere LINE (il default), BAR, STACKED, SCATTER o NONE.

source: Can be `true` or `false`.
it_it: Può essere `true` o `false`.

source: Can be a pointer to `lv_image_dsc_t` or a path to a file
it_it: Può essere un puntatore a `lv_image_dsc_t` o un percorso a un file.

source: Can be a pointer to `lv_image_dsc_t`, a path to a file or an `LV_SYMBOL_...`
it_it: Può essere un puntatore a `lv_image_dsc_t`, un path a un file o un `LV_SYMBOL_...`

source: Can be modified
it_it: Può essere modificato

source: Can be used to hide chart's data.
it_it: Può essere utilizzato per nascondere i dati del grafico.

source: Can be used together with ``range``.
it_it: Può essere utilizzato insieme a ``range``.

source: Can input two graphics planes on top of the background plane and blend them on the screen
it_it: Può inserire due piani grafici sopra il piano di background e fonderli sullo schermo

source: Can you specify different label content by calling :cpp:expr:`lv_scale_set_text_src(scale, custom_labels)` where ``custom_labels`` is an array of string pointers.
it_it: È possibile specificare un contenuto di etichetta diverso chiamando :cpp:expr:`lv_scale_set_text_src(scale, custom_labels)` dove ``custom_labels`` è un array di puntatori a stringa.

source: Canvas supports all the color formats like :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` or :cpp:enumerator:`LV_COLOR_FORMAT_I2`.
it_it: Il Canvas supporta tutti i formati colore come :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` o :cpp:enumerator:`LV_COLOR_FORMAT_I2`.

source: Care must be taken to avoid race conditions.
it_it: È necessario prestare attenzione per evitare condizioni di "race".

source: Care must be taken to avoid sending a command while there is an active transfer going on in the background.
it_it: È necessario prestare attenzione a non inviare un comando mentre è in corso un trasferimento attivo in background.

source: Cascading Styles
it_it: Stili a Cascata

source: Cause of Failure
it_it: Causa dell'Errore

source: Cells can be merged horizontally with :cpp:expr:`lv_table_set_cell_ctrl(table, row, col, LV_TABLE_CELL_CTRL_MERGE_RIGHT)`.
it_it: Le celle possono essere unite orizzontalmente con :cpp:expr:`lv_table_set_cell_ctrl(table, row, col, LV_TABLE_CELL_CTRL_MERGE_RIGHT)`.

source: Cells can store only text so numbers need to be converted to text before displaying them in a Table.
it_it: Le celle possono memorizzare solo testo, quindi i numeri devono essere convertiti in testo prima di essere visualizzati in una Tabella.

source: Centralized control over values (modify in one place).
it_it: Controllo centralizzato sui valori (modifica in un unico punto).

source: Change Log
it_it: Log delle Modifiche

source: Change Subject on Event
it_it: Modifica del Subject con l'Evento

source: Change font size with Tiny_TTF
it_it: Modificare la dimensione del font con Tiny_TTF

source: Change individual node properties using setter functions.
it_it: Modificare le singole proprietà dei nodi utilizzando le funzioni setter.

source: Change log
it_it: Log delle modifiche

source: Change orientation
it_it: Modificare l'orientamento

source: Change rate
it_it: Velocità di variazione

source: Change rate is defined in degrees/second units and can be set with :cpp:expr:`lv_arc_set_change_rate(arc, rate)`
it_it: La velocità di variazione è definita in gradi/secondo e può essere impostata con :cpp:expr:`lv_arc_set_change_rate(arc, rate)`

source: Change state
it_it: Cambio di stato

source: Change the first ``#if 0`` to ``1`` to enable the file's content and set the :c:macro:`LV_COLOR_DEPTH` define to align with the color depth used by your display panel.
it_it: Si modifica il primo ``#if 0`` a ``1`` per abilitare il contenuto del file e si imposta la definizione :c:macro:`LV_COLOR_DEPTH` in modo che si allinei alla profondità di colore utilizzata dal proprio pannello di visualizzazione.

source: Change these configurations:
it_it: Modificare queste configurazioni:

source: Change tile
it_it: Cambio di 'Tile'

source: Change:
it_it: Modificare:

source: Changes are queued and applied during the next render cycle:
it_it: Le modifiche vengono messe in coda e applicate durante il ciclo di rendering successivo:

source: Changes made by ``menuconfig`` are not being tracked in the repository if the ``sdkconfig`` file is added to ``.gitignore``, which is the default for many ESP-IDF projects.
it_it: Le modifiche apportate da ``menuconfig`` non vengono tracciate nel repository se il file ``sdkconfig`` viene aggiunto a ``.gitignore``, che è l'impostazione di default per molti progetti ESP-IDF.

source: Changing Order
it_it: Modifica dell'Ordine

source: Changing Resolution
it_it: Modifica della Risoluzione

source: Changing the knob offset allows the location of the knob to be moved relative to the end of the Arc.
it_it: Modificando l'offset del "knob" [manopola] è possibile spostarne la posizione rispetto alla fine dell'Arco.

source: Changing the start value to a value other than the minimum value in its range adjusts the start position of the indicator.
it_it: La modifica del valore iniziale su un valore diverso dal valore minimo nel suo intervallo regola la posizione iniziale dell'indicatore.

source: Characters entered not in this list will be ignored.
it_it: I caratteri inseriti non presenti in questo elenco verranno ignorati.

source: Chart
it_it: Grafico

source: Chart (lv_chart)
it_it: Grafici (lv_chart)

source: Chart Basics
it_it: Nozioni di Base sui Chart

source: Chart Widgets are used to visualize data.
it_it: I Widget "Chart" [grafici] vengono utilizzati per visualizzare i dati.

source: Chart layers
it_it: Layer di Chart

source: Chart type
it_it: Tipo di Chart

source: Charts can:
it_it: I Chart possono:

source: Charts have:
it_it: I Chart hanno:

source: Charts start their life as LINE charts.
it_it: I grafici iniziano la loro vita come grafici a linee.

source: Check :c:macro:`LV_COLOR_DEPTH` in *lv_conf.h*.
it_it: Controllare :c:macro:`LV_COLOR_DEPTH` in *lv_conf.h*.

source: Check it out to learn more about selecting the active language, retrieving translations, and fallback behavior.
it_it: Consultarlo per saperne di più sulla selezione della lingua attiva, sul recupero delle traduzioni e sul comportamento delle alternative.

source: Check out the `Online Demos`_ to see LVGL in action.
it_it: Consultate le `Online Demos`_ per vedere LVGL in azione.

source: Check out the examples to see how it can be used in the practice.
it_it: Controllare gli esempi per vedere come può essere utilizzato nella pratica.

source: Check out the following repositories for ready-to-use examples:
it_it: Consultare i seguenti repository per esempi pronti all'uso:

source: Check the API documentation for the function you are calling to be sure.
it_it: Per esserne certi, consultare la documentazione API della funzione che si sta chiamando.

source: Check there for your board parameters.
it_it: Controllare lì i parametri della propria scheda.

source: Check, uncheck, disable
it_it: Selezionare, deselezionare, disabilitare

source: Checkboxes as radio buttons
it_it: Checkbox come radio button

source: Checked State
it_it: Stato Checked

source: Child count
it_it: Conteggio dei figli

source: Children can be made snappable individually with the :cpp:enumerator:`LV_OBJ_FLAG_SNAPPABLE` flag.
it_it: I figli possono essere resi agganciabili individualmente con il flag :cpp:enumerator:`LV_OBJ_FLAG_SNAPPABLE`.

source: Children will be repositioned and resized according to policies set for the layout.
it_it: I figli verranno riposizionati e ridimensionati in base alle policy impostate per il layout.

source: Chinese calendar
it_it: Calendario cinese

source: Chip Vendor Support
it_it: Supporto ai Fornitori di Chip

source: Chips with a CPU data cache have unavoidable visual artifacts when using single-buffered direct mode.
it_it: I chip dotati di cache dati della CPU presentano inevitabili artefatti visivi quando si utilizza la modalità diretta "single-buffered".

source: Choose environments that match the "look" you want (outdoor, studio, warehouse, etc.)
it_it: Scegliere gli ambienti che corrispondono all'aspetto desiderato (esterno, studio, magazzino, ecc.)

source: CircuitPython was designed with education in mind, to make it easier for new or inexperienced programmers to get started with embedded development.
it_it: CircuitPython è stato progettato pensando alla didattica, per facilitare l'approccio allo sviluppo embedded da parte di programmatori nuovi o inesperti.

source: Circular line chart with gap
it_it: Grafico a linee circolari con spazio

source: Circular scrolling
it_it: Scrolling circolare

source: Clarification for LVGL Users
it_it: Chiarimento per gli utenti LVGL

source: Class files (``.bbclass``) contain information that is useful to share between recipes files.
it_it: I file di classe (``.bbclass``) contengono informazioni utili da condividere tra i file di ricette.

source: Classes
it_it: Classi

source: Clean and rebuild
it_it: Pulisce e ricompila

source: Clearcoat material support for multi-layer surface effects (like automotive paint finishes)
it_it: Supporto per materiali trasparenti per effetti di superficie multistrato (come finiture di vernice per auto)

source: Click "Apply and Close".
it_it: Cliccare su "Apply and Close".

source: Click "Manage Plugins ..." to find and install Figma to LVGL
it_it: Cliccare su "Manage Plugins ..." per cercare e installare Figma-LVGL

source: Click **Create Codespace on master**.
it_it: Cliccare su **Create Codespace on master**.

source: Click :ref:`here <unique_anchor_name>` for more details.
it_it: Cliccare :ref:`qui <unique_anchor_name>` per maggiori dettagli.

source: Click :ref:`unique_anchor_name` for more details.
it_it: Cliccare :ref:`unique_anchor_name` per maggiori dettagli.

source: Click [Select image file(s)] and select a BMP, PNG, JPG, WEBP or SVG image.
it_it: Si clicca su [Select image file(s)] e si seleziona un'immagine BMP, PNG, JPG, WEBP o SVG.

source: Click `here <https:// github.com/lvgl?q=lv_port_toradex&type=all&language=&sort=>`_ to check them out.
it_it: Cliccare `qui <https:// github.com/lvgl?q=lv_port_toradex&type=all&language=&sort=>`_ per consultarli.

source: Click on its tab button
it_it: Cliccare sul pulsante della scheda

source: Click on the "Add..." button.
it_it: Cliccare sul pulsante "Add...".

source: Click on the library you want from the results.
it_it: Cliccare sulla libreria desiderata tra i risultati.

source: Click streaks
it_it: Sequenze di clic

source: Click the "Submit" button and copy the generated file to your project
it_it: Cliccare sul pulsante "Submit" e copiare il file generato nel progetto

source: Click the *Propose changes* button.
it_it: Cliccare sul pulsante *Propose changes*.

source: Click the Debug button (|img_debug_btn|).
it_it: Cliccare sul pulsante Debug (|img_debug_btn|).

source: Click the Edit button in the top right-hand corner.
it_it: Cliccare sul pulsante Edit nell'angolo in alto a destra.

source: Click the [Convert] button.
it_it: Cliccare sul pulsante [Convert].

source: Click the green **Code** button.
it_it: Cliccare sul pulsante verde **Code**.

source: Click the play icon at the top of the CMSIS left side panel.
it_it: Cliccare sull'icona di riproduzione nella parte superiore del pannello laterale sinistro di CMSIS.
